# Dataframes

In [9]:
import pandas as pd

data = {'Year':[2001,2002,2003,2004,2005],
        'States':['Kerala','TN','Andhra','Karnataka','Bihar'],
        'Pop':[300,250,280,400,360]}
data

{'Year': [2001, 2002, 2003, 2004, 2005],
 'States': ['Kerala', 'TN', 'Andhra', 'Karnataka', 'Bihar'],
 'Pop': [300, 250, 280, 400, 360]}

In [13]:
#covert into df

pop_data = pd.DataFrame(data)
pop_data

   Year     States  Pop
0  2001     Kerala  300
1  2002         TN  250
2  2003     Andhra  280
3  2004  Karnataka  400
4  2005      Bihar  360

In [15]:
#single key muliple value pairs - dataframes

pop_data1 = pd.DataFrame(data, columns = ['Year','States','Pop','Income'])
pop_data1

   Year     States  Pop Income
0  2001     Kerala  300    NaN
1  2002         TN  250    NaN
2  2003     Andhra  280    NaN
3  2004  Karnataka  400    NaN
4  2005      Bihar  360    NaN

In [16]:
 pop_data1['Pop' ]

0    300
1    250
2    280
3    400
4    360
Name: Pop, dtype: int64

In [17]:
pop_data1['Income'] = 20000,30000,12000,15000,12000

In [18]:
pop_data1

   Year     States  Pop  Income
0  2001     Kerala  300   20000
1  2002         TN  250   30000
2  2003     Andhra  280   12000
3  2004  Karnataka  400   15000
4  2005      Bihar  360   12000

In [19]:
pop_data1['Debt']=[300,320,400,500,150]

In [20]:
pop_data1

   Year     States  Pop  Income  Debt
0  2001     Kerala  300   20000   300
1  2002         TN  250   30000   320
2  2003     Andhra  280   12000   400
3  2004  Karnataka  400   15000   500
4  2005      Bihar  360   12000   150

In [21]:
pop_data1['Savings']= pop_data1['Income']-pop_data1['Debt']

In [22]:
pop_data1

   Year     States  Pop  Income  Debt  Savings
0  2001     Kerala  300   20000   300    19700
1  2002         TN  250   30000   320    29680
2  2003     Andhra  280   12000   400    11600
3  2004  Karnataka  400   15000   500    14500
4  2005      Bihar  360   12000   150    11850

In [23]:
#deleting a column

del pop_data1['Pop']
pop_data1

   Year     States  Income  Debt  Savings
0  2001     Kerala   20000   300    19700
1  2002         TN   30000   320    29680
2  2003     Andhra   12000   400    11600
3  2004  Karnataka   15000   500    14500
4  2005      Bihar   12000   150    11850

In [25]:
pop_data1['Depth'] = 600
pop_data1

   Year     States  Income  Debt  Savings  Depth
0  2001     Kerala   20000   300    19700    600
1  2002         TN   30000   320    29680    600
2  2003     Andhra   12000   400    11600    600
3  2004  Karnataka   15000   500    14500    600
4  2005      Bihar   12000   150    11850    600

In [27]:
pop_data1.drop('Depth')

KeyError: "['Depth'] not found in axis"

In [28]:
#error bbcos, by default it will check in y axis, but depth is in x axis

pop_data1 = pop_data1.drop('Depth',axis=1)
pop_data1

   Year     States  Income  Debt  Savings
0  2001     Kerala   20000   300    19700
1  2002         TN   30000   320    29680
2  2003     Andhra   12000   400    11600
3  2004  Karnataka   15000   500    14500
4  2005      Bihar   12000   150    11850

In [30]:
pop_data1.ndim

2

In [31]:
pop_data1.size   #total elements

25

In [34]:
#loading csv files into the df

#auto_data = pd.read_csv('auto-mpg.csv') #csv should be in the same directory as python, else error.